
public class 함수정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// 함수란(자바에서 매서드) : 자바에서는 반드시 특정 클래스에 소속되어야 한다
		
		// 함수란: 명령어의 집합 => 특정기능을 수행하기 위한 코드 모음
		
		// 함수선언부: 시그니처와 함수 정의부로 구형되어 있다
		
		// public static 변환type 함수명(){}
		
		// 1,매서드 만들기(반드시 클래스 내부)
		// 2. 매서드 호출하기(만들어진진 대로, 매개변수, 반환을 확인하고 사용하기)
		// 3. 매서드의 반환값 사옹ㅇ(매서드에 호출한 자리를 변겨
		
		// 1. 매서드 만들기(반반드시 클래스 안에)
		// 2. 메서드
		
//		1/
		// 함수이름: 기능에 맞게 개발자가 부여함(첫 글자소문자 규칙, 숫자x)
		// 2. 매개변수(입력) 
		
		
//		자연변수(스택메모리) => 매서드(함수)안에 만들어지는 변수
//				>>
	}
//
	
	public static void 성적타출력() {
		System.out.println("====== NEW =");
		System.out.println("====== == =");
		System.out.println("====== // ======");
	}
}
