package javaprj.day07;

public class 함수만들기_박세인 {

	/*
	   입력 o  반환 o
	   입력 : 선수 이름
	   반환 : 선수에 대한 설명
	 */
	public static String 한화선수설명(String name) {
		
		if(name.equals("류현진")) {
			return "한화 이글스 투수, 메이저리그 토론토와 LA다저스에서 활약한 좌완 투수.\n"+"2005년 8월 31일, 2006년 신인 드래프트 2차 1라운드 전체 2순위로 한화 이글스에 지명되어.\n"+"사상 최초의 루키 시즌 트리플 크라운 및 신인왕 & MVP & 골든글러브 수상을 동시에 거머쥐며 전무후무한 임팩트를 뽐냈다."; 
		}else if(name.equals("문현빈")) {
			return "한화 이글스 내야수, 빠른 발과 컨택 능력이 좋은 선수.\n"+"야구에 집중하기 위해 SNS 계정을 삭제하고 독서를 한다고 한다.";
		}else if(name.equals("문동주")) {
			return "KBO 리그 토종 한국인 선발 투수 최초로 공식 구속 161km/h를 돌파한 선수.\n"+"전형적인 파이어볼러 유형이지만 구속만큼이나 제구력이 강점인 투수";
		}else if(name.equals("황영묵")) {
			return "한화 이글스 소속 내야수.\n"+"한화 이글스 입단 후 계속해서 좋은 활약을 보여주면서 묵이 베츠라는 별명도 얻었다.";
		}else if(name.equals("채은성")) {
			return "한화 이글스 소속 내야수.\n"+"2009년 LG 트윈스에 신고선수 신분으로 입단해 1군에 모습을 드러낸 2014년부터 꾸준히 활약하며 연습생 신화를 쓴 선수이며\n"+"2022년 11월 21일 한화 이글스와 6년 90억 원의 FA 계약을 맺으며 이적했고, 2024년부터 팀의 주장을 맡고 있다.";
		}else if(name.equals("노시환")) {
			return "한화 이글스 소속 우투우타 내야수. 주 포지션은 3루수.\n"+"옵션 포함 총액 307억 원으로 KBO 리그 역대 최장기,최고 금액 계약.\n"+"2026 시즌 종료 후 포스팅 시스템으로 MLB 진출 허용 시 계약 파기.";
		}else {
		return "선수 정보가 없습니다!";
		}
	}
	
	public static void main(String[] args) {

		String result = 한화선수설명("문현빈");
		System.out.println(result);

	}

}
