package 생성자;

public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// 객체지향
		// 1. 캡슐화
		// 2. 상속
		// 3. 다형성
		AcornStudent s = new AcornStudent(); // 객체 s 생성
		s.입력하기("사람이름", 500, 10, 30, 100); // s 객체에 정보가 입력하기()에 전달, 입력하기()에서 this키워드로 사용

		s.밥먹기();
		s.배열공부하기();
		s.정보출력하기();

		// 1. 데이터+데이터 다루는 함수(기능)
		// 2.객체의 정보를 정해진 방법(메서드)를 통해서만 변경하여 객체의 속성(데이터)이 잘못변경되는 걸 막음
		//

//		s.자바능력 = 2000; // 데이터보호를 위해 2가지 도구 제공ㄴ
		// 접근 제한자 private, public, default(같은 폴더)
		// 1) 접근제한자
		// 2) 생성자: 매서드와 동일하다(특별한 매서드 - 단 한번 new에 의해서 생성될 떄 호출되는 특별한 매서드)
		// 변수(객체)의 값을 초기화
		// 별도로 호출 불가

		// s객체는 참조가 사라지면
		// 객체의 정보를 저장하는 변수가 사라지면 객체는 가비지의 대상이 됨
		s = null;
		// null => 참조형변수의 기본값, null
		
		// 사람이름 객체를 사람이름2로 변경하기 // 가능함
		s.입력하기("사람이름1", 500, 10, 30, 100); // 입력하기()는 언제든 호출 가능
		s.정보출력하기();
		
		// 값의 입력은 필요하고 값의 입력이 여러번 호출되는 건 불필요
		// 따라서 값의 초기화를 담당하는 단 한 번 호출되는 특별한 매서드 제공
		
		// 1. 모든클래스는 기본생성자 제공. 기본생성자는 매개변수 없는 생성자
		// 2. 생성자 이름은 반드시 클래스 이름과 동일하게
		// 3. 
	}

}
